sirfonzie/esp32c3-mtk3/examples/ble_espmesh_demo/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"
# Default example console for the Super Mini/native USB-Serial-JTAG board kit.
# For M5StampC3, layer ../../sdkconfig.defaults.m5stamp_c3 after this file.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_LWIP_ENABLE=y
# Larger app partition — BLE + mesh + lwIP exceed the default 1 MB
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- WiFi / ESP-MESH (match the proven espmesh_demo config) ---
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=n
CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA=n
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
# Trim WiFi buffers to free IDF internal heap for mesh + BT controller (C3 RAM)
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_TX_BA_WIN=6
CONFIG_ESP_WIFI_RX_BA_WIN=6

# --- BLE (NimBLE) + WiFi/BLE software coexistence ---
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y
# Scan-all (observer) + non-connectable advertise (broadcaster); no GATT/conns
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=0
CONFIG_BT_NIMBLE_TASK_STACK_SIZE=1024
CONFIG_BT_NIMBLE_PINNED_TO_CORE=0

# KNOWN MTK3 LIMITATION: the mesh child only completes a connection when its
# channel EXACTLY matches the network channel (no scan/switch). channel=6/0
# (which require scan/switch) stall: WiFi associates but the child mesh
# handshake never finishes. Pin to the router's actual (fixed) channel.
CONFIG_ESPMESH_CHANNEL=10
